# Brewfile
#brew "lima"
#brew "colima"
#cask "utm"

cask_args appdir: "/Applications"
tap "mutagen-io/mutagen"

#tap "some repo I may need"
#brew "mas"

brew "jq"
brew "yq"
brew "zip"
brew "unzip"
brew "netcat"
brew "tree"
brew "git"
brew "make"
brew "wget"
brew "httpie"
brew "grep"
brew "sshpass"

brew "go"
brew "python"
brew "pipx"

brew "unixodbc"
brew "postgresql@14"

brew "act"
brew "docker"
brew "docker-buildx"
# brew "podman"
# brew "podman-compose"
# brew "rancher-cli"

brew "kubectl"
brew "kubernetes-cli"
brew "ko"
brew "helm"
brew "tilt"
brew "packer"
brew "minikube"
brew "qemu"

brew "mutagen-io/mutagen/mutagen"
brew "hashicorp/tap/terraform"
brew "cirruslabs/cli/tart"

cask "postman-agent"
cask "postman-cli"

cask "elgato-stream-deck"
cask "setapp"
cask "shottr"
cask "xnapper"
cask "iterm2"
cask "timing"
cask "postman"
cask "podman-desktop"
cask "rectangle"
cask "finch"
cask "rancher"
cask "jetbrains-toolbox"